{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "nB" : 512,
      "top" : "48",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 3,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "style",
      "blob_biases" : 1,
      "has_tanh" : 0,
      "debug_info" : "48",
      "name" : "48",
      "has_prelu" : 0
    },
    {
      "name" : "style.3",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "48",
      "debug_info" : "style.3",
      "dst_seq" : 1,
      "dst_k" : -1,
      "top" : "style.3"
    },
    {
      "bottom" : "style.3",
      "alpha" : 0.014731391333043575,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "modulation.1",
      "top" : "modulation.1",
      "type" : "elementwise",
      "name" : "modulation.1",
      "beta" : 0
    },
    {
      "top" : "hidden",
      "w" : 4,
      "h" : 4,
      "name" : "hidden",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 512,
      "bottom" : "",
      "debug_info" : "hidden",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 5
    },
    {
      "bottom" : "hidden,modulation.1",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "x.1",
      "top" : "x.1",
      "type" : "elementwise",
      "name" : "x.1",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "image.1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "image.1",
      "blob_weights" : 9,
      "K" : 512,
      "blob_biases" : 7,
      "name" : "image.1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "x.1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "top" : "77",
      "w" : 4,
      "h" : 4,
      "name" : "77",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "77",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 11
    },
    {
      "bottom" : "image.1,77",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "out.1",
      "top" : "out.1",
      "type" : "elementwise",
      "name" : "out.1",
      "beta" : 0
    },
    {
      "top" : "m.conv1.bias",
      "w" : 1,
      "h" : 1,
      "name" : "m.conv1.bias",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 512,
      "bottom" : "",
      "debug_info" : "m.conv1.bias",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 13
    },
    {
      "bottom" : "out.1,m.conv1.bias",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.1",
      "top" : "input.1",
      "type" : "elementwise",
      "name" : "input.1",
      "beta" : 0
    },
    {
      "alpha" : 0.20000000298023224,
      "bottom" : "input.1",
      "weights" : {

      },
      "mode" : 2,
      "debug_info" : "x.5",
      "top" : "x.5",
      "type" : "activation",
      "name" : "x.5"
    },
    {
      "nB" : 512,
      "top" : "91",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 17,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "style",
      "blob_biases" : 15,
      "has_tanh" : 0,
      "debug_info" : "91",
      "name" : "91",
      "has_prelu" : 0
    },
    {
      "name" : "93",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "91",
      "debug_info" : "93",
      "dst_seq" : 1,
      "dst_k" : -1,
      "top" : "93"
    },
    {
      "bottom" : "x.5,93",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "x.9",
      "top" : "x.9",
      "type" : "elementwise",
      "name" : "x.9",
      "beta" : 0
    },
    {
      "bottom" : "x.9",
      "end" : 128,
      "start" : 0,
      "weights" : {

      },
      "axis" : 2,
      "debug_info" : "yl.1",
      "top" : "yl.1",
      "type" : "slice",
      "name" : "yl.1"
    },
    {
      "bottom" : "x.9",
      "end" : 512,
      "start" : 128,
      "weights" : {

      },
      "axis" : 2,
      "debug_info" : "high.1",
      "top" : "high.1",
      "type" : "slice",
      "name" : "high.1"
    },
    {
      "name" : "h.3",
      "weights" : {

      },
      "dst_w" : 4,
      "version" : 1,
      "dst_n" : 128,
      "dst_nd_rank" : 5,
      "type" : "reshape",
      "dst_h" : 4,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "high.1",
      "debug_info" : "h.3",
      "dst_seq" : 1,
      "dst_k" : 3,
      "top" : "h.3"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 2,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 3,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "h.3",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "105",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "105",
      "begin_48" : 0,
      "top" : "105_0,105_1,105_2",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "size_of_axes" : 1,
      "bottom" : "105_0",
      "axes_0" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "squeeze_0",
      "version" : 1,
      "top" : "squeeze_0",
      "type" : "squeeze",
      "name" : "squeeze_0"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "105_1",
      "axes_0" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "squeeze_1",
      "version" : 1,
      "top" : "squeeze_1",
      "type" : "squeeze",
      "name" : "squeeze_1"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "105_2",
      "axes_0" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "squeeze_2",
      "version" : 1,
      "top" : "squeeze_2",
      "type" : "squeeze",
      "name" : "squeeze_2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "121_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "121_has_output_shape",
      "blob_weights" : 19,
      "K" : 128,
      "name" : "121_has_output_shape",
      "deconv_out_height" : 8,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "yl.1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 4,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "126_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "126_has_output_shape",
      "blob_weights" : 21,
      "K" : 128,
      "name" : "126_has_output_shape",
      "deconv_out_height" : 8,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "squeeze_0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 4,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "bottom" : "121_has_output_shape,126_has_output_shape",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "lo.3",
      "top" : "lo.3",
      "type" : "elementwise",
      "name" : "lo.3",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "140_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "140_has_output_shape",
      "blob_weights" : 23,
      "K" : 128,
      "name" : "140_has_output_shape",
      "deconv_out_height" : 8,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "squeeze_1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 4,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "145_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "145_has_output_shape",
      "blob_weights" : 25,
      "K" : 128,
      "name" : "145_has_output_shape",
      "deconv_out_height" : 8,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "squeeze_2",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 4,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "bottom" : "140_has_output_shape,145_has_output_shape",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "hi.5",
      "top" : "hi.5",
      "type" : "elementwise",
      "name" : "hi.5",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "159_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "159_has_output_shape",
      "blob_weights" : 27,
      "K" : 128,
      "stride_x" : 2,
      "name" : "159_has_output_shape",
      "deconv_out_height" : 8,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "lo.3",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "deconv_out_width" : 8,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "164_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "164_has_output_shape",
      "blob_weights" : 29,
      "K" : 128,
      "stride_x" : 2,
      "name" : "164_has_output_shape",
      "deconv_out_height" : 8,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "hi.5",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "deconv_out_width" : 8,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "159_has_output_shape,164_has_output_shape",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "x.11",
      "top" : "x.11",
      "type" : "elementwise",
      "name" : "x.11",
      "beta" : 0
    },
    {
      "nB" : 512,
      "top" : "175",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 128,
      "blob_weights" : 33,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "style",
      "blob_biases" : 31,
      "has_tanh" : 0,
      "debug_info" : "175",
      "name" : "175",
      "has_prelu" : 0
    },
    {
      "name" : "style.7",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "175",
      "debug_info" : "style.7",
      "dst_seq" : 1,
      "dst_k" : -1,
      "top" : "style.7"
    },
    {
      "bottom" : "style.7",
      "alpha" : 0.029462782666087151,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "modulation.5",
      "top" : "modulation.5",
      "type" : "elementwise",
      "name" : "modulation.5",
      "beta" : 0
    },
    {
      "bottom" : "x.11,modulation.5",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "x.13",
      "top" : "x.13",
      "type" : "elementwise",
      "name" : "x.13",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.15",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x.15",
      "blob_weights" : 35,
      "K" : 128,
      "name" : "x.15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "x.13",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "image.3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "image.3",
      "blob_weights" : 39,
      "K" : 128,
      "blob_biases" : 37,
      "name" : "image.3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "x.15",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "top" : "211",
      "w" : 8,
      "h" : 8,
      "name" : "211",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "211",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 41
    },
    {
      "bottom" : "image.3,211",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "out.5",
      "top" : "out.5",
      "type" : "elementwise",
      "name" : "out.5",
      "beta" : 0
    },
    {
      "top" : "m.layers.0.conv1.bias",
      "w" : 1,
      "h" : 1,
      "name" : "m.layers.0.conv1.bias",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 512,
      "bottom" : "",
      "debug_info" : "m.layers.0.conv1.bias",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 43
    },
    {
      "bottom" : "out.5,m.layers.0.conv1.bias",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.3",
      "top" : "input.3",
      "type" : "elementwise",
      "name" : "input.3",
      "beta" : 0
    },
    {
      "alpha" : 0.20000000298023224,
      "bottom" : "input.3",
      "weights" : {

      },
      "mode" : 2,
      "debug_info" : "x.19",
      "top" : "x.19",
      "type" : "activation",
      "name" : "x.19"
    },
    {
      "nB" : 512,
      "top" : "224",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 47,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "style",
      "blob_biases" : 45,
      "has_tanh" : 0,
      "debug_info" : "224",
      "name" : "224",
      "has_prelu" : 0
    },
    {
      "name" : "style.9",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "224",
      "debug_info" : "style.9",
      "dst_seq" : 1,
      "dst_k" : -1,
      "top" : "style.9"
    },
    {
      "bottom" : "style.9",
      "alpha" : 0.014731391333043575,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "modulation.7",
      "top" : "modulation.7",
      "type" : "elementwise",
      "name" : "modulation.7",
      "beta" : 0
    },
    {
      "bottom" : "x.19,modulation.7",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "x.21",
      "top" : "x.21",
      "type" : "elementwise",
      "name" : "x.21",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.23",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x.23",
      "blob_weights" : 49,
      "K" : 512,
      "name" : "x.23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 512,
      "bottom" : "x.21",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "image.5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "image.5",
      "blob_weights" : 53,
      "K" : 512,
      "blob_biases" : 51,
      "name" : "image.5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "x.23",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "top" : "260",
      "w" : 8,
      "h" : 8,
      "name" : "260",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "260",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 55
    },
    {
      "bottom" : "image.5,260",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "out.7",
      "top" : "out.7",
      "type" : "elementwise",
      "name" : "out.7",
      "beta" : 0
    },
    {
      "top" : "m.layers.0.conv2.bias",
      "w" : 1,
      "h" : 1,
      "name" : "m.layers.0.conv2.bias",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 512,
      "bottom" : "",
      "debug_info" : "m.layers.0.conv2.bias",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 57
    },
    {
      "bottom" : "out.7,m.layers.0.conv2.bias",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.5",
      "top" : "input.5",
      "type" : "elementwise",
      "name" : "input.5",
      "beta" : 0
    },
    {
      "alpha" : 0.20000000298023224,
      "bottom" : "input.5",
      "weights" : {

      },
      "mode" : 2,
      "debug_info" : "x.27",
      "top" : "x.27",
      "type" : "activation",
      "name" : "x.27"
    },
    {
      "nB" : 512,
      "top" : "280",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 61,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "style",
      "blob_biases" : 59,
      "has_tanh" : 0,
      "debug_info" : "280",
      "name" : "280",
      "has_prelu" : 0
    },
    {
      "name" : "282",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "280",
      "debug_info" : "282",
      "dst_seq" : 1,
      "dst_k" : -1,
      "top" : "282"
    },
    {
      "bottom" : "x.27,282",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "x.31",
      "top" : "x.31",
      "type" : "elementwise",
      "name" : "x.31",
      "beta" : 0
    },
    {
      "bottom" : "x.31",
      "end" : 128,
      "start" : 0,
      "weights" : {

      },
      "axis" : 2,
      "debug_info" : "yl.3",
      "top" : "yl.3",
      "type" : "slice",
      "name" : "yl.3"
    },
    {
      "bottom" : "x.31",
      "end" : 512,
      "start" : 128,
      "weights" : {

      },
      "axis" : 2,
      "debug_info" : "high.3",
      "top" : "high.3",
      "type" : "slice",
      "name" : "high.3"
    },
    {
      "name" : "h.7",
      "weights" : {

      },
      "dst_w" : 8,
      "version" : 1,
      "dst_n" : 128,
      "dst_nd_rank" : 5,
      "type" : "reshape",
      "dst_h" : 8,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "high.3",
      "debug_info" : "h.7",
      "dst_seq" : 1,
      "dst_k" : 3,
      "top" : "h.7"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 2,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 3,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "h.7",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "294",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "294",
      "begin_48" : 0,
      "top" : "294_0,294_1,294_2",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "size_of_axes" : 1,
      "bottom" : "294_0",
      "axes_0" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "squeeze_3",
      "version" : 1,
      "top" : "squeeze_3",
      "type" : "squeeze",
      "name" : "squeeze_3"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "294_1",
      "axes_0" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "squeeze_4",
      "version" : 1,
      "top" : "squeeze_4",
      "type" : "squeeze",
      "name" : "squeeze_4"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "294_2",
      "axes_0" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "squeeze_5",
      "version" : 1,
      "top" : "squeeze_5",
      "type" : "squeeze",
      "name" : "squeeze_5"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "310_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "310_has_output_shape",
      "blob_weights" : 63,
      "K" : 128,
      "name" : "310_has_output_shape",
      "deconv_out_height" : 16,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "yl.3",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 8,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "315_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "315_has_output_shape",
      "blob_weights" : 65,
      "K" : 128,
      "name" : "315_has_output_shape",
      "deconv_out_height" : 16,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "squeeze_3",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 8,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "bottom" : "310_has_output_shape,315_has_output_shape",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "lo.7",
      "top" : "lo.7",
      "type" : "elementwise",
      "name" : "lo.7",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "329_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "329_has_output_shape",
      "blob_weights" : 67,
      "K" : 128,
      "name" : "329_has_output_shape",
      "deconv_out_height" : 16,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "squeeze_4",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 8,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "334_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "334_has_output_shape",
      "blob_weights" : 69,
      "K" : 128,
      "name" : "334_has_output_shape",
      "deconv_out_height" : 16,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "squeeze_5",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 8,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "bottom" : "329_has_output_shape,334_has_output_shape",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "hi.11",
      "top" : "hi.11",
      "type" : "elementwise",
      "name" : "hi.11",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "348_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "348_has_output_shape",
      "blob_weights" : 71,
      "K" : 128,
      "stride_x" : 2,
      "name" : "348_has_output_shape",
      "deconv_out_height" : 16,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "lo.7",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "deconv_out_width" : 16,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "353_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "353_has_output_shape",
      "blob_weights" : 73,
      "K" : 128,
      "stride_x" : 2,
      "name" : "353_has_output_shape",
      "deconv_out_height" : 16,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "hi.11",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "deconv_out_width" : 16,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "348_has_output_shape,353_has_output_shape",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "x.33",
      "top" : "x.33",
      "type" : "elementwise",
      "name" : "x.33",
      "beta" : 0
    },
    {
      "nB" : 512,
      "top" : "364",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 128,
      "blob_weights" : 77,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "style",
      "blob_biases" : 75,
      "has_tanh" : 0,
      "debug_info" : "364",
      "name" : "364",
      "has_prelu" : 0
    },
    {
      "name" : "style.13",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "364",
      "debug_info" : "style.13",
      "dst_seq" : 1,
      "dst_k" : -1,
      "top" : "style.13"
    },
    {
      "bottom" : "style.13",
      "alpha" : 0.029462782666087151,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "modulation.11",
      "top" : "modulation.11",
      "type" : "elementwise",
      "name" : "modulation.11",
      "beta" : 0
    },
    {
      "bottom" : "x.33,modulation.11",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "x.35",
      "top" : "x.35",
      "type" : "elementwise",
      "name" : "x.35",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.37",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x.37",
      "blob_weights" : 79,
      "K" : 128,
      "name" : "x.37",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "x.35",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "image.7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "image.7",
      "blob_weights" : 83,
      "K" : 128,
      "blob_biases" : 81,
      "name" : "image.7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "x.37",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "top" : "400",
      "w" : 16,
      "h" : 16,
      "name" : "400",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "400",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 85
    },
    {
      "bottom" : "image.7,400",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "out.11",
      "top" : "out.11",
      "type" : "elementwise",
      "name" : "out.11",
      "beta" : 0
    },
    {
      "top" : "m.layers.1.conv1.bias",
      "w" : 1,
      "h" : 1,
      "name" : "m.layers.1.conv1.bias",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 512,
      "bottom" : "",
      "debug_info" : "m.layers.1.conv1.bias",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 87
    },
    {
      "bottom" : "out.11,m.layers.1.conv1.bias",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.7",
      "top" : "input.7",
      "type" : "elementwise",
      "name" : "input.7",
      "beta" : 0
    },
    {
      "alpha" : 0.20000000298023224,
      "bottom" : "input.7",
      "weights" : {

      },
      "mode" : 2,
      "debug_info" : "x.41",
      "top" : "x.41",
      "type" : "activation",
      "name" : "x.41"
    },
    {
      "nB" : 512,
      "top" : "413",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 91,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "style",
      "blob_biases" : 89,
      "has_tanh" : 0,
      "debug_info" : "413",
      "name" : "413",
      "has_prelu" : 0
    },
    {
      "name" : "style.15",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "413",
      "debug_info" : "style.15",
      "dst_seq" : 1,
      "dst_k" : -1,
      "top" : "style.15"
    },
    {
      "bottom" : "style.15",
      "alpha" : 0.014731391333043575,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "modulation.13",
      "top" : "modulation.13",
      "type" : "elementwise",
      "name" : "modulation.13",
      "beta" : 0
    },
    {
      "bottom" : "x.41,modulation.13",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "x.43",
      "top" : "x.43",
      "type" : "elementwise",
      "name" : "x.43",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "x.45",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x.45",
      "blob_weights" : 93,
      "K" : 512,
      "name" : "x.45",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 512,
      "bottom" : "x.43",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "image.9",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "image.9",
      "blob_weights" : 97,
      "K" : 512,
      "blob_biases" : 95,
      "name" : "image.9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "x.45",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "top" : "449",
      "w" : 16,
      "h" : 16,
      "name" : "449",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "449",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 99
    },
    {
      "bottom" : "image.9,449",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "out.13",
      "top" : "out.13",
      "type" : "elementwise",
      "name" : "out.13",
      "beta" : 0
    },
    {
      "top" : "m.layers.1.conv2.bias",
      "w" : 1,
      "h" : 1,
      "name" : "m.layers.1.conv2.bias",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 512,
      "bottom" : "",
      "debug_info" : "m.layers.1.conv2.bias",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 101
    },
    {
      "bottom" : "out.13,m.layers.1.conv2.bias",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.9",
      "top" : "input.9",
      "type" : "elementwise",
      "name" : "input.9",
      "beta" : 0
    },
    {
      "alpha" : 0.20000000298023224,
      "bottom" : "input.9",
      "weights" : {

      },
      "mode" : 2,
      "debug_info" : "x.49",
      "top" : "x.49",
      "type" : "activation",
      "name" : "x.49"
    },
    {
      "nB" : 512,
      "top" : "469",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 105,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "style",
      "blob_biases" : 103,
      "has_tanh" : 0,
      "debug_info" : "469",
      "name" : "469",
      "has_prelu" : 0
    },
    {
      "name" : "471",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "469",
      "debug_info" : "471",
      "dst_seq" : 1,
      "dst_k" : -1,
      "top" : "471"
    },
    {
      "bottom" : "x.49,471",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "x.53",
      "top" : "x.53",
      "type" : "elementwise",
      "name" : "x.53",
      "beta" : 0
    },
    {
      "bottom" : "x.53",
      "end" : 128,
      "start" : 0,
      "weights" : {

      },
      "axis" : 2,
      "debug_info" : "yl.5",
      "top" : "yl.5",
      "type" : "slice",
      "name" : "yl.5"
    },
    {
      "bottom" : "x.53",
      "end" : 512,
      "start" : 128,
      "weights" : {

      },
      "axis" : 2,
      "debug_info" : "high.5",
      "top" : "high.5",
      "type" : "slice",
      "name" : "high.5"
    },
    {
      "name" : "h.11",
      "weights" : {

      },
      "dst_w" : 16,
      "version" : 1,
      "dst_n" : 128,
      "dst_nd_rank" : 5,
      "type" : "reshape",
      "dst_h" : 16,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "high.5",
      "debug_info" : "h.11",
      "dst_seq" : 1,
      "dst_k" : 3,
      "top" : "h.11"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 2,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 3,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "h.11",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "483",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "483",
      "begin_48" : 0,
      "top" : "483_0,483_1,483_2",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "size_of_axes" : 1,
      "bottom" : "483_0",
      "axes_0" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "squeeze_6",
      "version" : 1,
      "top" : "squeeze_6",
      "type" : "squeeze",
      "name" : "squeeze_6"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "483_1",
      "axes_0" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "squeeze_7",
      "version" : 1,
      "top" : "squeeze_7",
      "type" : "squeeze",
      "name" : "squeeze_7"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "483_2",
      "axes_0" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "squeeze_8",
      "version" : 1,
      "top" : "squeeze_8",
      "type" : "squeeze",
      "name" : "squeeze_8"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "499_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "499_has_output_shape",
      "blob_weights" : 107,
      "K" : 128,
      "name" : "499_has_output_shape",
      "deconv_out_height" : 32,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "yl.5",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 16,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "504_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "504_has_output_shape",
      "blob_weights" : 109,
      "K" : 128,
      "name" : "504_has_output_shape",
      "deconv_out_height" : 32,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "squeeze_6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 16,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "bottom" : "499_has_output_shape,504_has_output_shape",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "lo.11",
      "top" : "lo.11",
      "type" : "elementwise",
      "name" : "lo.11",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "518_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "518_has_output_shape",
      "blob_weights" : 111,
      "K" : 128,
      "name" : "518_has_output_shape",
      "deconv_out_height" : 32,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "squeeze_7",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 16,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "523_has_output_shape",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "523_has_output_shape",
      "blob_weights" : 113,
      "K" : 128,
      "name" : "523_has_output_shape",
      "deconv_out_height" : 32,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "squeeze_8",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "deconv_out_width" : 16,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "bottom" : "518_has_output_shape,523_has_output_shape",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "hi.17",
      "top" : "hi.17",
      "type" : "elementwise",
